Revit 2027 API
CoordinationModelLinkUtils.SetColorOverride Method
 Sets the color override value for the provided Coordination Model type.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetColorOverride(
	Document document,
	View view,
	Element coordinationModelType,
	Color color
)
Public Shared Sub SetColorOverride (
	document As Document,
	view As View,
	coordinationModelType As Element,
	color As Color
)
public:
static void SetColorOverride(
	Document^ document,
	View^ view,
	Element^ coordinationModelType,
	Color^ color
)
static member SetColorOverride :
        document : Document *
        view : View *
        coordinationModelType : Element *
        color : Color -> unit
Parameters
document Document
 The document.
view View
 The view.
coordinationModelType Element
 The Coordination Model type element.
color Color
 Value of the color for the override. InvalidColorValue means no override is set.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The element coordinationModelType was not found in the given document. -or- The provided element is not a Coordination Model type.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 By default, the color setting has no override and its value is InvalidColorValue.
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace